## Pandas Dataframes

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame()

In [6]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df = pd.read_csv('PandasExample.csv')

In [10]:
df

       Name  Age  Gender
0   Dheeraj   24    Male
1     Niraj   20    Male
2     Suraj   23    Male
3  Niharika   22  Female
4   Saurabh   18    Male
5     Sujal   17    Male

In [12]:
df.head()  # top 5 rows

       Name  Age  Gender
0   Dheeraj   24    Male
1     Niraj   20    Male
2     Suraj   23    Male
3  Niharika   22  Female
4   Saurabh   18    Male

In [14]:
df.tail()  # bottom 5 rows

       Name  Age  Gender
1     Niraj   20    Male
2     Suraj   23    Male
3  Niharika   22  Female
4   Saurabh   18    Male
5     Sujal   17    Male

In [16]:
df.head(2)  # first 2 rows

      Name  Age Gender
0  Dheeraj   24   Male
1    Niraj   20   Male

In [18]:
df.tail(2)  # last 2 rows

      Name  Age Gender
4  Saurabh   18   Male
5    Sujal   17   Male

In [20]:
df.iloc[0]  # return 0 index value

Name      Dheeraj
Age            24
Gender       Male
Name: 0, dtype: object

In [22]:
df.iloc[3]

Name      Niharika
Age             22
Gender      Female
Name: 3, dtype: object

In [24]:
df.values   # return all values in array

array([['Dheeraj', 24, 'Male'],
       ['Niraj', 20, 'Male'],
       ['Suraj', 23, 'Male'],
       ['Niharika', 22, 'Female'],
       ['Saurabh', 18, 'Male'],
       ['Sujal', 17, 'Male']], dtype=object)

<p><b>Note:</b> If the file size is very large, we can also read the file and chunk sizes as following </p>

In [53]:
df = pd.read_csv('PandasExample.csv', chunksize=2) 
# return an iterable

In [55]:
for chunk in df:
    print(chunk)

      Name  Age Gender
0  Dheeraj   24   Male
1    Niraj   20   Male
       Name  Age  Gender
2     Suraj   23    Male
3  Niharika   22  Female
      Name  Age Gender
4  Saurabh   18   Male
5    Sujal   17   Male

##### Comparison: with vs without chunksize

| Without `chunksize`           | With `chunksize=2`    |
| ----------------------------- | --------------------- |
| Entire CSV loaded into memory | Data loaded in parts  |
| `df` is a DataFrame           | `df` is an iterator   |
| Faster for small files        | Safer for large files |

In [64]:
df = pd.read_csv('PandasExample.csv')

In [66]:
df = df[df['Age'] > 20]  
df

       Name  Age  Gender
0   Dheeraj   24    Male
2     Suraj   23    Male
3  Niharika   22  Female